{
  "version": "2.0",
  "author": "Steven Holland",
  "copyright": "© 2025 Steven Holland. All rights reserved.",
  "traits": [
    {
      "bit": 1,
      "name": "Physical Object",
      "layer": "Physical",
      "short": "A discrete, bounded physical entity.",
      "expanded": "A tangible object that has physical boundaries and occupies space. It is not a process, idea, or distributed field. Physical objects may be natural or artificial, but their form is defined by matter and boundedness. This contrasts with unbounded or distributed media like a gas, fluid, or electromagnetic field."
    },
    {
      "bit": 2,
      "name": "Synthetic",
      "layer": "Physical",
      "short": "Created or manufactured by humans.",
      "expanded": "The entity was created, manufactured, constructed, or significantly shaped by human activity or intention. It contrasts with natural formations that emerge without design or intervention."
    },
    {
      "bit": 3,
      "name": "Biological/Biomimetic",
      "layer": "Physical",
      "short": "Has biological origin or structure inspired by biology.",
      "expanded": "Either a biological organism, component, or artifact that mimics or draws design inspiration from biological structures or behaviors (e.g., neural nets, bionic limbs)."
    },
    {
      "bit": 4,
      "name": "Powered",
      "layer": "Physical",
      "short": "Functionally dependent on supplied energy.",
      "expanded": "The entity requires an energy source (electrical, chemical, kinetic, etc.) to operate or activate. This reliance on power is embedded in its design or structure, even if dormant."
    },
    {
      "bit": 5,
      "name": "Structural",
      "layer": "Physical",
      "short": "Serves a load-bearing or structural function.",
      "expanded": "An element that contributes to the integrity or stability of a larger physical form, especially in engineered or constructed systems. Often crucial for shape retention, safety, or support."
    },
    {
      "bit": 6,
      "name": "Observable",
      "layer": "Physical",
      "short": "Detectable by human senses or instruments.",
      "expanded": "The entity can be directly sensed — visually, audibly, tactilely — without requiring deep interpretation. It may also be detectable through instruments that extend human perception."
    },
    {
      "bit": 7,
      "name": "Physical Medium",
      "layer": "Physical",
      "short": "Composed of physical matter.",
      "expanded": "The entity has substance, occupying space and consisting of matter. This includes both discrete objects and distributed or unbounded matter like gases, magnetic fields, or the medium of sound propagation. It distinguishes physical substrates from data, abstractions, or symbolic patterns."
    },
    {
      "bit": 8,
      "name": "Active",
      "layer": "Physical",
      "short": "Capable of initiating behavior or internal change.",
      "expanded": "The entity is capable of autonomous or internally driven change or behavior. It contrasts with passive entities that only respond when acted upon. For example, a robot with internal motors is active; a photochromic lens that darkens in sunlight is not active but may be state-transforming."
    },
    {
      "bit": 9,
      "name": "Intentionally Designed",
      "layer": "Functional",
      "short": "Created or adapted with deliberate purpose.",
      "expanded": "The entity was intentionally shaped or configured to fulfill a specific function or goal. Its structure or behavior reflects purposeful design."
    },
    {
      "bit": 10,
      "name": "Outputs Effect",
      "layer": "Functional",
      "short": "Actively produces energy, signal, or change.",
      "expanded": "The entity generates or emits a physical, informational, or functional output as part of its operation — including light, sound, motion, heat, or data."
    },
    {
      "bit": 11,
      "name": "Processes Signals/Logic",
      "layer": "Functional",
      "short": "Performs information processing or control.",
      "expanded": "The entity interprets, transforms, or routes data, logic, or signals — whether mechanically, electronically, or symbolically."
    },
    {
      "bit": 12,
      "name": "State-Transforming",
      "layer": "Functional",
      "short": "Undergoes or causes internal change.",
      "expanded": "The entity changes its own internal state or configuration, either autonomously or in response to input — including chemical, physical, digital, or logical transformation."
    },
    {
      "bit": 13,
      "name": "Human-Interactive",
      "layer": "Functional",
      "short": "Interfaces directly with human users.",
      "expanded": "The entity is designed to be activated, manipulated, interpreted, or experienced by a human as part of its normal function."
    },
    {
      "bit": 14,
      "name": "System-integrated",
      "layer": "Functional",
      "short": "Inherently embedded within a system.",
      "expanded": "The entity operates as a part of a larger, organized system or network. Its function depends on or contributes to an integrated structure."
    },
    {
      "bit": 15,
      "name": "Functionally Autonomous",
      "layer": "Functional",
      "short": "Operates independently via internal logic.",
      "expanded": "The entity performs actions or tasks without continuous external control, often responding to inputs or environmental conditions autonomously."
    },
    {
      "bit": 16,
      "name": "System-Essential",
      "layer": "Functional",
      "short": "Crucial to system operation or identity.",
      "expanded": "The entity is a necessary component of a broader system; without it, the system fails or loses defining capabilities."
    },
    {
      "bit": 17,
      "name": "Symbolic",
      "layer": "Abstract",
      "short": "Represents concepts through signs or stand-ins.",
      "expanded": "The entity serves as a sign, symbol, or representation of something else — such as an idea, identity, system, or category."
    },
    {
      "bit": 18,
      "name": "Signalling",
      "layer": "Abstract",
      "short": "Conveys information or meaning via signals or forms.",
      "expanded": "The entity actively communicates or encodes meaning through patterns, structures, signals, or formats that are interpretable within a system or by an observer."
    },
    {
      "bit": 19,
      "name": "Rule-governed",
      "layer": "Abstract",
      "short": "Follows or defines abstract rules or formal logic.",
      "expanded": "The entity operates according to explicit or implied abstract rules — such as grammars, logical structures, algorithms, or formal constraints."
    },
    {
      "bit": 20,
      "name": "Compositional",
      "layer": "Abstract",
      "short": "Structured through modular or hierarchical parts.",
      "expanded": "The entity exhibits modular, layered, or nested structure — enabling it to be composed of meaningful subcomponents that function together as a coherent whole."
    },
    {
      "bit": 21,
      "name": "Normative",
      "layer": "Abstract",
      "short": "Constrains or directs behavior through norms or expectations.",
      "expanded": "The entity defines or promotes expected behaviors, actions, or interpretations — through rules, values, instructions, conventions, or social expectations."
    },
    {
      "bit": 22,
      "name": "Meta",
      "layer": "Abstract",
      "short": "Refers to itself or its conceptual structure.",
      "expanded": "The entity references its own category, structure, or system-level definition. Often used in meta-modeling, abstraction layers, or reflective reasoning."
    },
    {
      "bit": 23,
      "name": "Temporal",
      "layer": "Abstract",
      "short": "Has essential time-based structure or identity.",
      "expanded": "Time defines the entity’s form or function — such as sequencing, rhythm, scheduling, or temporal dependencies."
    },
    {
      "bit": 24,
      "name": "Digital/Virtual",
      "layer": "Abstract",
      "short": "Exists as a digital or simulated abstraction.",
      "expanded": "The entity is virtual, encoded, or computational in nature — it may exist only in digital environments, simulations, or software abstractions, rather than in physical form."
    },
    {
      "bit": 25,
      "name": "Social Construct",
      "layer": "Social",
      "short": "Exists through collective social agreement or convention.",
      "expanded": "The entity has no independent physical reality but exists because of shared understanding, belief, or societal consensus — such as roles, money, or norms."
    },
    {
      "bit": 26,
      "name": "Institutionally Defined",
      "layer": "Social",
      "short": "Classified or authorized by a formal group or system.",
      "expanded": "The entity’s status or function is determined by an institution, organization, or collective body — such as legal definitions, academic roles, or medical classifications."
    },
    {
      "bit": 27,
      "name": "Identity-Linked",
      "layer": "Social",
      "short": "Tied to personal, group, or role-based identity.",
      "expanded": "The entity is associated with individual or collective identity — including titles, affiliations, roles, cultural heritage, or social status."
    },
    {
      "bit": 28,
      "name": "Regulated",
      "layer": "Social",
      "short": "Governed or constrained by rules or laws.",
      "expanded": "The entity is subject to formal or informal regulation, whether through law, policy, institutional control, or social norms."
    },
    {
      "bit": 29,
      "name": "Economically Significant",
      "layer": "Social",
      "short": "Has financial value or plays a role in economic systems.",
      "expanded": "The entity affects or participates in financial systems, markets, or value exchange — through cost, trade, labor, production, or investment."
    },
    {
      "bit": 30,
      "name": "Politicised",
      "layer": "Social",
      "short": "Carries political implications or is subject to political contestation.",
      "expanded": "The entity is involved in power dynamics, governance, ideological positioning, or political debate — either directly or through symbolic association."
    },
    {
      "bit": 31,
      "name": "Ritualised",
      "layer": "Social",
      "short": "Embedded in cultural or symbolic ritual practice.",
      "expanded": "The entity is structured, repeated, or formalized in ways that give it cultural significance through ritual, ceremony, or tradition."
    },
    {
      "bit": 32,
      "name": "Ethically Significant",
      "layer": "Social",
      "short": "Subject to ethical evaluation or moral interpretation.",
      "expanded": "The entity invokes, reflects, or depends on ethical or moral considerations — including fairness, responsibility, harm, justice, or right/wrong framing."
    }
  ]
}
